### Terraform Plan 📦
```
[command]/home/runner/work/_temp/01400578-63ec-488e-9751-e1f81d53d57a/terraform-bin plan -no-color -var-file=prod.tfvars
data.aws_route53_zone.route53_existing_zone: Reading...
data.aws_route53_zone.route53_existing_zone: Read complete after 0s [id=Z087900818DA70F3QYIWE]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.virginia_cert will be created
  + resource "aws_acm_certificate" "virginia_cert" {
      + arn                       = (known after apply)
      + domain_name               = "*.prod.fieldwork48.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.prod.fieldwork48.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.prod.fieldwork48.com",
        ]
      + tags                      = {
          + "Env"     = "default"
          + "Name"    = "terrademo1-default-wildcard-sslcert"
          + "Project" = "terrademo1"
        }
      + tags_all                  = {
          + "Env"     = "default"
          + "Name"    = "terrademo1-default-wildcard-sslcert"
          + "Project" = "terrademo1"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.cert_validation will be created
  + resource "aws_acm_certificate_validation" "cert_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudfront_distribution.s3_distribution will be created
  + resource "aws_cloudfront_distribution" "s3_distribution" {
      + aliases                         = [
          + "default.prod.fieldwork48.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "S3 origin CloudFront distribution"
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_200"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Environment" = "default"
        }
      + tags_all                        = {
          + "Environment" = "default"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + custom_error_response {
          + error_caching_min_ttl = 0
          + error_code            = 403
          + response_code         = 200
          + response_page_path    = "/index.html"
        }
      + custom_error_response {
          + error_caching_min_ttl = 0
          + error_code            = 404
          + response_code         = 200
          + response_page_path    = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "s3-origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "s3-origin"

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_origin_access_identity.oai will be created
  + resource "aws_cloudfront_origin_access_identity" "oai" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "OAI for accessing S3 static site"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # aws_dynamodb_table.tf_rock will be created
  + resource "aws_dynamodb_table" "tf_rock" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "Terraform_LockTable_20251021"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "default"
          + "Name"        = "Terraform Lock Table"
          + "Project"     = "terrademo1"
        }
      + tags_all         = {
          + "Environment" = "default"
          + "Name"        = "Terraform Lock Table"
          + "Project"     = "terrademo1"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }
    }

  # aws_route53_record.cert_validation["*.prod.fieldwork48.com"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z087900818DA70F3QYIWE"
    }

  # aws_route53_record.cloudfront_alias will be created
  + resource "aws_route53_record" "cloudfront_alias" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "default.static.fieldwork48.com"
      + type            = "A"
      + zone_id         = "Z087900818DA70F3QYIWE"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_s3_bucket.s3_terraform_statefile will be created
  + resource "aws_s3_bucket" "s3_terraform_statefile" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "terraform-statefile-20251021"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_versioning.s3_terraform_statefile_versioning will be created
  + resource "aws_s3_bucket_versioning" "s3_terraform_statefile_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.static_site_bucket.aws_s3_bucket.static_site will be created
  + resource "aws_s3_bucket" "static_site" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "terraform-staticsite-20251021"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "default"
          + "Project"     = "terrademo1"
          + "dummy"       = "dummy18"
        }
      + tags_all                    = {
          + "Environment" = "default"
          + "Project"     = "terrademo1"
          + "dummy"       = "dummy18"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.static_site_bucket.aws_s3_bucket_policy.static_site_policy will be created
  + resource "aws_s3_bucket_policy" "static_site_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.static_site_bucket.aws_s3_bucket_public_access_block.static_site will be created
  + resource "aws_s3_bucket_public_access_block" "static_site" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.static_site_bucket.aws_s3_bucket_website_configuration.static_site_config will be created
  + resource "aws_s3_bucket_website_configuration" "static_site_config" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "404.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_route53_zone.route53_existing_zone: Reading...%0Adata.aws_route53_zone.route53_existing_zone: Read complete after 0s [id=Z087900818DA70F3QYIWE]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_acm_certificate.virginia_cert will be created%0A  + resource "aws_acm_certificate" "virginia_cert" {%0A      + arn                       = (known after apply)%0A      + domain_name               = "*.prod.fieldwork48.com"%0A      + domain_validation_options = [%0A          + {%0A              + domain_name           = "*.prod.fieldwork48.com"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A        ]%0A      + id                        = (known after apply)%0A      + key_algorithm             = (known after apply)%0A      + not_after                 = (known after apply)%0A      + not_before                = (known after apply)%0A      + pending_renewal           = (known after apply)%0A      + renewal_eligibility       = (known after apply)%0A      + renewal_summary           = (known after apply)%0A      + status                    = (known after apply)%0A      + subject_alternative_names = [%0A          + "*.prod.fieldwork48.com",%0A        ]%0A      + tags                      = {%0A          + "Env"     = "default"%0A          + "Name"    = "terrademo1-default-wildcard-sslcert"%0A          + "Project" = "terrademo1"%0A        }%0A      + tags_all                  = {%0A          + "Env"     = "default"%0A          + "Name"    = "terrademo1-default-wildcard-sslcert"%0A          + "Project" = "terrademo1"%0A        }%0A      + type                      = (known after apply)%0A      + validation_emails         = (known after apply)%0A      + validation_method         = "DNS"%0A    }%0A%0A  # aws_acm_certificate_validation.cert_validation will be created%0A  + resource "aws_acm_certificate_validation" "cert_validation" {%0A      + certificate_arn         = (known after apply)%0A      + id                      = (known after apply)%0A      + validation_record_fqdns = (known after apply)%0A    }%0A%0A  # aws_cloudfront_distribution.s3_distribution will be created%0A  + resource "aws_cloudfront_distribution" "s3_distribution" {%0A      + aliases                         = [%0A          + "default.prod.fieldwork48.com",%0A        ]%0A      + arn                             = (known after apply)%0A      + caller_reference                = (known after apply)%0A      + comment                         = "S3 origin CloudFront distribution"%0A      + continuous_deployment_policy_id = (known after apply)%0A      + default_root_object             = "index.html"%0A      + domain_name                     = (known after apply)%0A      + enabled                         = true%0A      + etag                            = (known after apply)%0A      + hosted_zone_id                  = (known after apply)%0A      + http_version                    = "http2"%0A      + id                              = (known after apply)%0A      + in_progress_validation_batches  = (known after apply)%0A      + is_ipv6_enabled                 = true%0A      + last_modified_time              = (known after apply)%0A      + price_class                     = "PriceClass_200"%0A      + retain_on_delete                = false%0A      + staging                         = false%0A      + status                          = (known after apply)%0A      + tags                            = {%0A          + "Environment" = "default"%0A        }%0A      + tags_all                        = {%0A          + "Environment" = "default"%0A        }%0A      + trusted_key_groups              = (known after apply)%0A      + trusted_signers                 = (known after apply)%0A      + wait_for_deployment             = true%0A%0A      + custom_error_response {%0A          + error_caching_min_ttl = 0%0A          + error_code            = 403%0A          + response_code         = 200%0A          + response_page_path    = "/index.html"%0A        }%0A      + custom_error_response {%0A          + error_caching_min_ttl = 0%0A          + error_code            = 404%0A          + response_code         = 200%0A          + response_page_path    = "/index.html"%0A        }%0A%0A      + default_cache_behavior {%0A          + allowed_methods        = [%0A              + "GET",%0A              + "HEAD",%0A            ]%0A          + cached_methods         = [%0A              + "GET",%0A              + "HEAD",%0A            ]%0A          + compress               = true%0A          + default_ttl            = (known after apply)%0A          + max_ttl                = (known after apply)%0A          + min_ttl                = 0%0A          + target_origin_id       = "s3-origin"%0A          + trusted_key_groups     = (known after apply)%0A          + trusted_signers        = (known after apply)%0A          + viewer_protocol_policy = "redirect-to-https"%0A%0A          + forwarded_values {%0A              + headers                 = (known after apply)%0A              + query_string            = false%0A              + query_string_cache_keys = (known after apply)%0A%0A              + cookies {%0A                  + forward           = "none"%0A                  + whitelisted_names = (known after apply)%0A                }%0A            }%0A        }%0A%0A      + origin {%0A          + connection_attempts = 3%0A          + connection_timeout  = 10%0A          + domain_name         = (known after apply)%0A          + origin_id           = "s3-origin"%0A%0A          + s3_origin_config {%0A              + origin_access_identity = (known after apply)%0A            }%0A        }%0A%0A      + restrictions {%0A          + geo_restriction {%0A              + locations        = (known after apply)%0A              + restriction_type = "none"%0A            }%0A        }%0A%0A      + viewer_certificate {%0A          + acm_certificate_arn      = (known after apply)%0A          + minimum_protocol_version = "TLSv1.2_2021"%0A          + ssl_support_method       = "sni-only"%0A        }%0A    }%0A%0A  # aws_cloudfront_origin_access_identity.oai will be created%0A  + resource "aws_cloudfront_origin_access_identity" "oai" {%0A      + arn                             = (known after apply)%0A      + caller_reference                = (known after apply)%0A      + cloudfront_access_identity_path = (known after apply)%0A      + comment                         = "OAI for accessing S3 static site"%0A      + etag                            = (known after apply)%0A      + iam_arn                         = (known after apply)%0A      + id                              = (known after apply)%0A      + s3_canonical_user_id            = (known after apply)%0A    }%0A%0A  # aws_dynamodb_table.tf_rock will be created%0A  + resource "aws_dynamodb_table" "tf_rock" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PAY_PER_REQUEST"%0A      + hash_key         = "LockID"%0A      + id               = (known after apply)%0A      + name             = "Terraform_LockTable_20251021"%0A      + read_capacity    = (known after apply)%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags             = {%0A          + "Environment" = "default"%0A          + "Name"        = "Terraform Lock Table"%0A          + "Project"     = "terrademo1"%0A        }%0A      + tags_all         = {%0A          + "Environment" = "default"%0A          + "Name"        = "Terraform Lock Table"%0A          + "Project"     = "terrademo1"%0A        }%0A      + write_capacity   = (known after apply)%0A%0A      + attribute {%0A          + name = "LockID"%0A          + type = "S"%0A        }%0A    }%0A%0A  # aws_route53_record.cert_validation["*.prod.fieldwork48.com"] will be created%0A  + resource "aws_route53_record" "cert_validation" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = (known after apply)%0A      + records         = (known after apply)%0A      + ttl             = 60%0A      + type            = (known after apply)%0A      + zone_id         = "Z087900818DA70F3QYIWE"%0A    }%0A%0A  # aws_route53_record.cloudfront_alias will be created%0A  + resource "aws_route53_record" "cloudfront_alias" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = "default.static.fieldwork48.com"%0A      + type            = "A"%0A      + zone_id         = "Z087900818DA70F3QYIWE"%0A%0A      + alias {%0A          + evaluate_target_health = false%0A          + name                   = (known after apply)%0A          + zone_id                = (known after apply)%0A        }%0A    }%0A%0A  # aws_s3_bucket.s3_terraform_statefile will be created%0A  + resource "aws_s3_bucket" "s3_terraform_statefile" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "terraform-statefile-20251021"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = (known after apply)%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # aws_s3_bucket_versioning.s3_terraform_statefile_versioning will be created%0A  + resource "aws_s3_bucket_versioning" "s3_terraform_statefile_versioning" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0A  # module.static_site_bucket.aws_s3_bucket.static_site will be created%0A  + resource "aws_s3_bucket" "static_site" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "terraform-staticsite-20251021"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "default"%0A          + "Project"     = "terrademo1"%0A          + "dummy"       = "dummy18"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "default"%0A          + "Project"     = "terrademo1"%0A          + "dummy"       = "dummy18"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.static_site_bucket.aws_s3_bucket_policy.static_site_policy will be created%0A  + resource "aws_s3_bucket_policy" "static_site_policy" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A    }%0A%0A  # module.static_site_bucket.aws_s3_bucket_public_access_block.static_site will be created%0A  + resource "aws_s3_bucket_public_access_block" "static_site" {%0A      + block_public_acls       = false%0A      + block_public_policy     = false%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = false%0A      + restrict_public_buckets = false%0A    }%0A%0A  # module.static_site_bucket.aws_s3_bucket_website_configuration.static_site_config will be created%0A  + resource "aws_s3_bucket_website_configuration" "static_site_config" {%0A      + bucket           = (known after apply)%0A      + id               = (known after apply)%0A      + routing_rules    = (known after apply)%0A      + website_domain   = (known after apply)%0A      + website_endpoint = (known after apply)%0A%0A      + error_document {%0A          + key = "404.html"%0A        }%0A%0A      + index_document {%0A          + suffix = "index.html"%0A        }%0A    }%0A%0APlan: 13 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

```